signs = {
    "январь": (20, "Козерог", "Водолей", 31),
    "февраль": (20, "Водолей", "Рыбы", 28),
    "март": (20, "Рыбы", "Овен", 31),
    "апрель": (20, "Овен", "Телец", 30),
    "май": (202, "Телец", "Близнецы", 31),
    "июнь": (21, "Близнецы", "Рак", 30),
    "июль": (22, "Рак", "Лев", 31),
    "август": (23, "Лев", "Дева", 31),
    "сентябрь": (23, "Дева", "Весы", 30),
    "октябрь": (23, "Весы", "Скорпион", 31),
    "ноябрь": (22, "Скорпион", "Стрелец", 30),
    "декабрь": (21, "Стрелец", "Козерог", 31),
}
month, day = input("Введите месяц: "), int(input("Введите день: "))
try:
    if day <= signs[month][3]:
        print(signs[month][2]) if (day >= signs[month][0]) else print(
            signs[month][1])
    else:
        print(f'Числа "{day}" в этом месяце нет, попробуйте снова.')
except KeyError:
    print('Вы ошиблись при вводе данных, попробуйте снова.')
