cook_book = [
    ['салат',
        [
            ['картофель', 100, 'гр.'],
            ['морковь', 50, 'гр.'],
            ['огурцы', 50, 'гр.'],
            ['горошек', 30, 'гр.'],
            ['майонез', 70, 'мл.'],
        ]
     ],
    ['пицца',
        [
            ['сыр', 50, 'гр.'],
            ['томаты', 50, 'гр.'],
            ['тесто', 100, 'гр.'],
            ['бекон', 30, 'гр.'],
            ['колбаса', 30, 'гр.'],
            ['грибы', 20, 'гр.'],
        ],
     ],
    ['фруктовый десерт',
        [
            ['хурма', 60, 'гр.'],
            ['киви', 60, 'гр.'],
            ['творог', 60, 'гр.'],
            ['сахар', 10, 'гр.'],
            ['мед', 50, 'мл.'],
        ]
     ]
]
person = 5

for i in range(len(cook_book)):
    print(f'{cook_book[i][0].capitalize()}:')
    for j in range(len(cook_book[i][1])):
        print(f'{cook_book[i][1][j][0]}, '
              f'{cook_book[i][1][j][1] * person}{cook_book[i][1][j][2]}')
    print('')
